/** 车牌号验证方法
 * 1. 普通车牌号格式
 *  汉字 + A-Z + 5位，A-Z或0-9，车牌号不存在字母 I 和 O 防止和 1、0 混淆
 *  包括了普通车牌号，教练车，警等车牌号，部分部队车，不包括新能源车牌
 *  车牌号规则
 *  [京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1}
 * 
 * 2. 新能源车格式
 *  省份简称（1位汉字）+ 发牌机关代号（1位字母）+序号（6位），总计8个字符，序号不能出现字母I和字母O
 *  小型车，第一位：只能用字母D或字母F，第二位：字母或者数字，后四位：必须使用数字
 *  [DF][A-HJ-NP-Z0-9][0-9]{4}
 * 
 *  大型车，前五位：必须使用数字，第六位：只能用字母D或字母F
 *  [0-9]{5}[DF]
 * 
 *  [京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF])|([DF][A-HJ-NP-Z0-9][0-9]{4}))
 * 
 */


export const plateNumber = str => {
  // 新能源车牌号
  const xreg = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF]$)|([DF][A-HJ-NP-Z0-9][0-9]{4}$))/

  // 普通车牌号
  const reg = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1}$/

  if (str.length === 7) return reg.test(str)
  else if (str.length === 8) return xreg.test(str)
  else return false
}